#Задание 1.
a = input('Введите своё имя - ')
b = input('Введите свой возраст - ')
c = input('Ваше любимое число - ')
print('Общие данные: ', 'Имя -', a, 'Возраст -', b, 'Число -', c)


#Задание 2.
time = int(input('Введите нужное количество секунд для подсчёта - '))
h = time // 3600
m = (time - h * 3600) // 60
s = time - (h * 3600 + m * 60)
print(f'Ваше время чч:мм:сс {"%02d" % h}:{"%02d" % m}:{"%02d" % s}')


#Задание 3.
num = input('Введите число - ')
a =int(num + num)
b =int(num + num + num)
outcome = int(num) + a + b
print(outcome)


#Задание 4.
a = input('Введите число - ')
x = 0
for i in a:
    while int(i) > x:
        x = int(i)
print('Самая большая цифра - 'x)


#Задание 5.
a = float(input('Введите выручку фирмы: '))
b = float(input('Введите издержки фирмы: '))
if a > b:
    print('Фирма работает с пыбылью')
    income = a - b
    print('Рентабельность фирмы {:%}'.format(income / a))
    c = int(input('Введите количество сотрудников фирмы: '))
    print(f'Доходность фирмы на сотрудника составляет {income / employees} у.е.')
else:
    print('Фирма работает в убыток')


#Задание 6.
a = int(input("Введите результаты пробежки первого дня в км "))
b = int(input("Введите общий желаемый результат в км "))






